02 Software/01 Broncode/operatiebrp-code-145.3/migratie/migr-test-isc/regressie-brp-bevraging-gba/uc1004-10-opvragen pl webservice/uc1004-10C40T150/1000-uit-ws_gba_vraagPL-OpvragenPL.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <soap:Body xmlns:m="http://brp.bzk.nl/delivery/bevraging/gba/ws">
        <m:vraagPL>
            <m:in0>
                <m:parameters>
                    <m:item>
                        <m:rubrieknummer>10110</m:rubrieknummer>
                        <m:zoekwaarde>1452747329</m:zoekwaarde>
                    </m:item>
                    <m:item>
                        <m:rubrieknummer>77010</m:rubrieknummer>
                        <m:zoekwaarde>0</m:zoekwaarde>
                    </m:item>
                </m:parameters>
            </m:in0>
        </m:vraagPL>
    </soap:Body>
</soap:Envelope>
